[
    {
        "name":"Я на hh.ru",
        "site_link":"https://bryansk.hh.ru/resume/2cc743f9ff0bfe0c010039ed1f456965696d36",
        "hub_link":"https://github.com/Rekonir",
        "linkColor":"orange",
        "photo":"https://img.hhcdn.ru/photo/726058750.jpeg?t=1685956511&h=93oRDJ6WEiR7ng2frzhqqw",
        "description": "Уважаемый работодатель, представляю вам мой сайт-портфолио. \n Я окончил среднюю образовательную школу №28 г.Брянска с золотой медалью в 2015 году, Санкт-Петербургский горный университет на звание бакалавра с синим дипломом в 2019 году и на звание магистра с красным дипломом в 2021 году. Кроме того, я прошел курсы CISCO по направлениям «Интернет вещей», «Кибербезопасность» и «IT Essentials», благодаря чему получил опыт работы системного администратора в аппаратной части.\n Также получил сертификат по HTML верстке и продолжил обучение на Frontend-разработчика. Я владею навыками работы с такими технологиями, как HTML, Pug, CSS, SCSS, JS, TS, Jest, React, Redux, Axios. У меня есть опыт работы с Docker и Kotlin, и я имел практику руководства коллективом из 13 человек.\n Я готов работать усердно и всегда рад учиться новым технологиям для достижения общих целей."
    },
    {
        "name":"Sultan Shop",
        "site_link":"https://rekonir.github.io/shop/",
        "hub_link":"https://github.com/Rekonir/shop.git",
        "linkColor":"orange",
        "photo":"./src/img/Sultan.png",
        "description": "Этот проект представляет собой интернет-магазин, специализирующийся на продаже средств по уходу. Он был разработан в рамках курсовой работы по курсу Frontend. В основе проекта лежит локальная база данных, по которой происходит демонстрация каталога товаров согласно выставленным фильтрам и сортировке. Если количество товаров в базе больше 10, то на сайте появляется динамическая пагинация. Фильтры по типам ухода расположены в верхней и левой панелях и синхронизированы между собой, а поисковик по странам облегает выделение производителей. На странице администрации есть возможность добавления новых товаров в каталог или удаления уже имеющихся. При добавлении товаров в корзину пересчитываются количество позиций и общая стоимость. При переходе на страницу покупок отображается более детальная информация о выбранных позициях. При клике на карточку товара, происходит переход на страницу с подробной информацией о товаре, где можно добавить несколько единиц позиции. Проект был разработан на основе готового макета в Figma. Кроме того, проект адаптирован под мобильные устройства. Использовались технологии React, Redux, TypeScript, SCSS и Jest."
    },
    {
        "name":"Gobbo Selector",
        "site_link":"https://rekonir.github.io/Gobbo/",
        "hub_link":"https://github.com/Rekonir/Gobbo.git",
        "linkColor":"purple",
        "photo":"./src/img/Gobbo.png",
        "description": "Сайт сделан для личных нужд.  Он представляет собой фильтр базы данных, который осуществляется через использование ползунков, задаваемых клиентом. Для создания дизайна сайта используется эффект параллакса, который позволяет отслеживать положение мыши на экране и соответствующим образом изменять фон. Для реализации данного проекта используются следующие технологии: Pug - шаблонизатор, позволяющий упростить написание HTML-кода и улучшить его читаемость; SCSS - язык для описания стилей веб-страниц, который позволяет использовать более сложные структуры стилей; и JavaScript - язык программирования, который обеспечивает интерактивность сайта."

    },
    {
        "name":"Hotels",
        "site_link":"https://rekonir.github.io/Hotels/",
        "hub_link":"https://github.com/Rekonir/Hotels.git",
        "linkColor":"blue",
        "photo":"./src/img/Hotel.png",
        "description": "Платформа для бронирования отелей, написанный в качестве выпускной работы по курсам HTML верстки. Имеются следующие страницы: Главная, Каталог, Карточка отеля, Блоки входа и регистрации, Ошибка. Динамика присутствует только в изменении фона, переключением слайдов фотографий отеля, выбора чекбоксов и детализирование отображения отзывов. Использовались: pug, scss, js."

    },
    {
        "name":"Comments Form",
        "site_link":"https://rekonir.github.io/CommentForm/",
        "hub_link":"https://github.com/Rekonir/CommentForm.git",
        "linkColor":"green",
        "photo":"./src/img/Comment.png",
        "description": "API имитирующие заметки. При вводе ника, даты и текста, соответствующее сообщение появляется в окне лога. Опубликованные сообщения можно «пролайкать» или удалить, а время отображается с учетом сегодняшней даты (вчерашняя дата будет отображать «Вчера», завтра – «Завтра»). Использовались: pug, scss, js."

    },
    {
        "name":"Git Searcher",
        "site_link":"https://rekonir.github.io/GitSearch/",
        "hub_link":"https://github.com/Rekonir/GitSearch.git",
        "linkColor":"red",
        "photo":"./src/img/GitSearch.png",
        "description": "API для поиска среди базы GitHub репозиториев позволяет пользователям быстро и эффективно найти нужные репозитории на GitHub. Этот API использует алгоритм совпадения для первоначальной сортировки результатов поиска, что позволяет пользователю увидеть наиболее подходящие репозитории сразу же, и затем – остальные, которые также соответствуют запросу, но, возможно, менее точно. Таким образом, с помощью API для поиска среди базы GitHub репозиториев, разработчики могут легко создавать веб-страницы и интерфейсы для быстрого поиска и просмотра репозиториев на GitHub. Использовались: pug, scss, js."

    },
    {
        "name":"Fireplace Shop",
        "site_link":"https://rekonir.github.io/fireplaces/",
        "hub_link":"https://github.com/Rekonir/fireplaces.git",
        "linkColor":"red",
        "photo":"./src/img/Fireplace.png",
        "description": "Для выполнения вступительной работы по верстке для курса обучения Frontend, необходимо было создать страничку для магазина каминов. Страница должна была соответствовать предоставленному шаблону в Figma и не иметь никакой динамики и адаптивности. Верстка отличалась наличием переходов заднего фона, которые эмулировали свечение пламени. Кроме того, на странице были использованы стилизованные чекбоксы. Использовались: pug, scss."

    },
    {
        "name":"Chairs Shop",
        "site_link":"https://rekonir.github.io/chairs/",
        "hub_link":"https://github.com/Rekonir/chairs.git",
        "linkColor":"red",
        "photo":"./src/img/Cheirs.png",
        "description": "Вступительная работа по верстке для курса обучения Frontend. Требовалось сделать простую страничку для магазина кресел и какой-либо динамики без адаптивности согласно предоставленную шаблону в Figma. Использовались: pug, scss."

    }
]