[
    {
        "name":"Я на hh.ru",
        "site_link":"https://bryansk.hh.ru/resume/2cc743f9ff0bfe0c010039ed1f456965696d36",
        "hub_link":"https://github.com/Rekonir",
        "linkColor":"orange",
        "photo":"https://img.hhcdn.ru/photo/726058750.jpeg?t=1685956511&h=93oRDJ6WEiR7ng2frzhqqw",
        "description": "Уважаемый работодатель представляю вам мой сайт-портфолио. \n Я окончил среднюю образовательную школу №28 г.Брянска с золотой медалью в 2015 году, Санкт-Петербургский горный университет на звание бакалавра с синим дипломом в 2019 году и на звание магистра с красным дипломом в 2021 году. Кроме того, я прошел курсы CISCO по направлениям «Интернет вещей», «Кибербезопасность» и «IT Essentials», благодаря чему получил опыт работы системного администратора в аппаратной части.\n Также получил сертификат по HTML верстке и продолжил обучение на Frontend-разработчика. Я владею навыками работы с такими технологиями, как HTML, Pug, CSS, SCSS, JS, TS, Jest, React, Redux, Axios. У меня есть опыт работы с Docker и Kotlin, и я имел практику руководства коллективом из 13 человек.\n Я готов работать усердно и всегда рад учиться новым технологиям для достижения общих целей."
    },
    {
        "name":"Sultan Shop",
        "site_link":"https://rekonir.github.io/shop/",
        "hub_link":"https://github.com/Rekonir/shop.git",
        "linkColor":"orange",
        "photo":"/src/img/Sultan.png",
        "description": "Интернет-магазин, по продаже средств по уходу. Делался в качестве курсовой работы по курсу обучения Frontend. На основе локальной базы данных, происходит демонстрация каталога, согласно выставленным фильтрам и сортировки. Также появляется динамическая пагинация, если количество товаров в базе больше 10. Фильтры по типам ухода в верхней и в левой панели синхронизированы, а поисковик по странам облегает выделение производителей. На странице администрации есть возможность добавление новых товаров в каталог или удаление уже имеющихся. При добавлении в корзину, автоматически пересчитывается количество позиций и суммарная стоимость, а при переходе на страницу покупок эта информация отображается более детально. При клике на карточку товара, происходит переход на соответствующую страницу с подробной информацией и возможностью добавления сразу нескольких единиц позиции. Проект делался по уже готовому шаблону Figma. Присутвует адаптивность для мобильных устройств. Использовались: React, Redux, TS, scss, jest."
    },
    {
        "name":"Gobbo Selector",
        "site_link":"https://rekonir.github.io/Gobbo/",
        "hub_link":"https://github.com/Rekonir/Gobbo.git",
        "linkColor":"purple",
        "photo":"/src/img/Gobbo.png",
        "description": "Сайт, сделанный для личных нужд. По сути, представляет фильтр базы данных согласно требованием клиента, которые задаются ползунками. Фон отображается с эффектом параллакс, отслеживающий положение мыши на экране. Использовались pug, scss, js."

    },
    {
        "name":"Hotels",
        "site_link":"https://rekonir.github.io/Hotels/",
        "hub_link":"https://github.com/Rekonir/Hotels.git",
        "linkColor":"blue",
        "photo":"/src/img/Hotel.png",
        "description": "Сайт бронирования отелей, написанный в качестве выпускной работы по курсам HTML верстки. Имеются следующие страницы: Главная, Каталог, Карточка отеля, Блоки входа и регистрации, Ошибка. Динамика присутствует только в изменении фона, переключением слайдов фотографий отеля, выбора чекбоксов и детализирование отображения отзывов. Использовались: pug, scss, js."

    },
    {
        "name":"Comments Form",
        "site_link":"https://rekonir.github.io/CommentForm/",
        "hub_link":"https://github.com/Rekonir/CommentForm.git",
        "linkColor":"green",
        "photo":"/src/img/Comment.png",
        "description": "API имитирующие заметки. При вводе ника, даты и текста, соответствующее сообщение появляется в окне лога. Опубликованные сообщения можно «пролайкать» или удалить, а время отображается с учетом сегодняшней даты (вчерашняя дата будет отображать «Вчера», завтра – «Завтра»). Использовались: pug, scss, js."

    },
    {
        "name":"Git Searcher",
        "site_link":"https://rekonir.github.io/GitSearch/",
        "hub_link":"https://github.com/Rekonir/GitSearch.git",
        "linkColor":"red",
        "photo":"/src/img/GitSearch.png",
        "description": "API для поиска среди базы GitHub репозиториев. В первую очередь показываются варианты с максимальным совпадением, а после – те, которые в той или иной степени удовлетворяют запросу. Использовались: pug, scss, js."

    },
    {
        "name":"Fireplace Shop",
        "site_link":"https://rekonir.github.io/fireplaces/",
        "hub_link":"https://github.com/Rekonir/fireplaces.git",
        "linkColor":"red",
        "photo":"/src/img/Fireplace.png",
        "description": "Вступительная работа по верстке для курса обучения Frontend. Требовалось сделать страничку для магазина каминов без какой-либо динамики и адаптивности согласно предоставленную шаблону в Figma. Верстка отличалась переходами заднего фона, эмитирующую свечение пламени и стилизованными чекбоксами. Использовались: pug, scss."

    },
    {
        "name":"Chairs Shop",
        "site_link":"https://rekonir.github.io/chairs/",
        "hub_link":"https://github.com/Rekonir/chairs.git",
        "linkColor":"red",
        "photo":"/src/img/Cheirs.png",
        "description": "Вступительная работа по верстке для курса обучения Frontend. Требовалось сделать простую страничку для магазина кресел и какой-либо динамики без адаптивности согласно предоставленную шаблону в Figma. Использовались: pug, scss."

    }
]